# Mengganti nama kolom pada Data Frame

# Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

# Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)
df

   A  B  C  D  E
0  1  3  3  6  6
1  6  4  4  6  5
2  4  5  6  5  1
3  2  9  3  9  3
4  4  2  8  5  5

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [5]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  1  3     3  6  6
1  6  4     4  6  5
2  4  5     6  5  1
3  2  9     3  9  3
4  4  2     8  5  5

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [6]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     1       3  3     6  6
1     6       4  4     6  5
2     4       5  6     5  1
3     2       9  3     9  3
4     4       2  8     5  5